from django.shortcuts import render

# Create your views here.
def about(request):
    template = 'pages/about.html'
    context = {
        'title': 'О проекте',
        'page_heading': 'О проекте',
        'content': '''<p>
          Блогикум — это дом для творческих людей. Это — сообщество людей, для которых 
          нет грани между ведением блога и дружбой в социальных сетях. 
        </p>
        <p>
          Дружба и рассказы о новых, неизведанных впечатлениях — вот 
          что вы найдете на нашем ресурсе.  Миллионы блогов по различным темам. 
          Путешествия, политики, развлечения, мода, мода, литература, дизайн и все 
          другие сферы человеческой деятельности. 
        </p>
        <p>
          Творчество, разнообразие и свобода взглядов и самовыражения — 
          основные черты наших пользователей.
        </p>'''
    }
    return render(request, template, context)

def rules(request):
    template = 'pages/rules.html'
    context = {
        'title': 'Rules',
        'page_heading': 'Наши правила',
        'content': '''<p>
          <b>Cамовыражение.</b> У наших пользователей должна
          быть возможность создать что-то своё, выразить себя,
          свои мысли и чувства.
        </p>
        <p>
          <b>Многообразие.</b> Мы уважаем и приветствуем разные
          мнения и культуры. Блогикум — это место, объединяющее
          самых разных людей. Поделитесь своим уникальным взглядом на мир.
        </p>
        <p>
          <b>Творчество.</b> Не важно, в какой области вы творите,
          это может быть литература, дизайн, программирование.
          Наши инструменты помогут вам раскрыть талант максимально
          просто и комфортно.
        </p>
        <p>
          <b>Личность.</b> Мы сохраним ваши сокровенные мысли в тайне.
          Делитесь своей информацией только с теми, кого выбрали.
          Как и насколько засекречивать вашу личную информацию —
          определяете вы и только вы.
        </p>'''
    }
    return render(request, template, context)